<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"f305a4311b3a02d748f40444b4628ec855af1e39e7d39de42253536e5c96593b","plan_job_ref":"Job Test actions using target and replace #455 at https://github.com/dflook/terraform-github-actions/actions/runs/12936786423","plan_out_hash":"e3e9ceb8da5f7bafb05baa0980b31bcd5332f5ab768dc4434b86128d4bec05b4","plan_hash":"703c3920016be1bca72ac27a06063bc420516cf6da276f22526a0fa55df3969b","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "o2wonGUPob" -> (known after apply)
!~  foreach = "dwzniKR8e9" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #455](https://github.com/dflook/terraform-github-actions/actions/runs/12936786423)